app/controllers/posts_controller.rb

	def update
		@post =Post.find(params[:id])

		if(@post.update(post_params)
			redirect_to @post)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Boss Baby"], ["body", "Children show blah blah blah"], ["updated_at", "2017-08-14 03:11:25.589281"], ["id", 9]]